In [1]:
import panda

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\envs\sethuraman\lib\site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\envs\sethuraman\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\admin\anaconda3\envs\sethuraman\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\envs\sethuraman\lib\site-packages (from pandas) (2022.6)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\envs\sethuraman\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as ps

In [4]:
ps.__version__

'1.5.2'

In [5]:
a1=ps.Series(['one',2,3,4,5],index=[0,1,2,3,4])

In [6]:
print(a1)

0    one
1      2
2      3
3      4
4      5
dtype: object

In [7]:
vac_attendance=ps.Series([123,234,345],index=[1,2,3])

In [8]:
print(vac_attendance)

1    123
2    234
3    345
dtype: int64

In [9]:
s={"diet":{1:'10days',2:'10days',3:'20days',4:'5days'},"food":{1:'chicken',2:'fish',3:'egg',4:'veggies'}}

In [10]:
d=ps.DataFrame(s,columns=["food","diet"])

In [11]:
print(d)

      food    diet
1  chicken  10days
2     fish  10days
3      egg  20days
4  veggies   5days

In [12]:
d

      food    diet
1  chicken  10days
2     fish  10days
3      egg  20days
4  veggies   5days

In [13]:
import numpy as ny

In [42]:
x=ps.DataFrame(ny.random.randint(0,300,size=(10,4)),columns=['sethu','natesh','tamil','riyas'])

In [43]:
print(x)

   sethu  natesh  tamil  riyas
0      1     111     73    207
1    122     234    146     62
2     28     201    212     31
3     43      87    286     88
4     43     221     96    129
5    210     183    100     59
6    248      96    231    255
7     95      39    289    263
8    243     293    207    194
9    103     145    133    270

In [44]:
x

   sethu  natesh  tamil  riyas
0      1     111     73    207
1    122     234    146     62
2     28     201    212     31
3     43      87    286     88
4     43     221     96    129
5    210     183    100     59
6    248      96    231    255
7     95      39    289    263
8    243     293    207    194
9    103     145    133    270

In [48]:
x.to_csv('D:\pandas\sethu.csv')

In [51]:
x=ps.read_csv('D:/pandas/sethu.csv')

In [52]:
x

   Unnamed: 0.1  Unnamed: 0  sethu  natesh  tamil  riyas
0             0           0      1     111     73    207
1             1           1    122     234    146     62
2             2           2     28     201    212     31
3             3           3     43      87    286     88
4             4           4     43     221     96    129
5             5           5    210     183    100     59
6             6           6    248      96    231    255
7             7           7     95      39    289    263
8             8           8    243     293    207    194
9             9           9    103     145    133    270

In [53]:
print(x)

   Unnamed: 0.1  Unnamed: 0  sethu  natesh  tamil  riyas
0             0           0      1     111     73    207
1             1           1    122     234    146     62
2             2           2     28     201    212     31
3             3           3     43      87    286     88
4             4           4     43     221     96    129
5             5           5    210     183    100     59
6             6           6    248      96    231    255
7             7           7     95      39    289    263
8             8           8    243     293    207    194
9             9           9    103     145    133    270

In [69]:
x.drop("sethu",axis=1)

   Unnamed: 0.1  Unnamed: 0  natesh  tamil  riyas
0             0           0     111     73    207
1             1           1     234    146     62
2             2           2     201    212     31
3             3           3      87    286     88
4             4           4     221     96    129
5             5           5     183    100     59
6             6           6      96    231    255
7             7           7      39    289    263
8             8           8     293    207    194
9             9           9     145    133    270

In [70]:
y=x.drop("sethu",axis=1)

In [71]:
y

   Unnamed: 0.1  Unnamed: 0  natesh  tamil  riyas
0             0           0     111     73    207
1             1           1     234    146     62
2             2           2     201    212     31
3             3           3      87    286     88
4             4           4     221     96    129
5             5           5     183    100     59
6             6           6      96    231    255
7             7           7      39    289    263
8             8           8     293    207    194
9             9           9     145    133    270

In [72]:
x.shape

(10, 6)

In [73]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0.1  10 non-null     int64
 1   Unnamed: 0    10 non-null     int64
 2   sethu         10 non-null     int64
 3   natesh        10 non-null     int64
 4   tamil         10 non-null     int64
 5   riyas         10 non-null     int64
dtypes: int64(6)
memory usage: 608.0 bytes